public class Main {
    public static void main(String[] args) {
//        ========================== QUESTION-1 : WORD CLASS =========================

        System.out.println("--- QUESTION-1 : WORD CLASS ---");

        Word newWord = new Word("כלב", "dog");
        System.out.println(newWord);
        System.out.println();

//        ========================= QUESTION-2 : UNKNOWN CLASS =========================

//        part 1:-
//        Unknown class has three constructors:-
//        1: public Unknown(int num1, int num2){}
//        2: public Unknown(){}
//        3: public Unknown(int numX, double numY){}

//        part 2:-
//        public int get1(){ return first value; }

//        part 3:-
//        public boolean f(double numX, double numY){ return (true / false); }
//        * עדיך שהפרמטרים יהיו מסוג דאבל כי אז נוכל להכניס מספרים מסוג אנט וגם דאבל *

//        ========================== QUESTION-3 : LOOPS ========================

//        part 1:-
//        * המטודה f1 היא מטודה שלא מחזירה ערך (void) אלא מדפיסה ערך *
//        * הלולאה פור מקבלת משתנה מסוג אנט והערך שלה הוא 1, ואז בודקת אם הערך קטן שווה 10, ואז מוסיפה להמשתנה 1 *
//        * כל עוד התנאי הזה נכון יוסף 1 למשתנה וימשיך הלאה *
//        * אחרי זה הוא ידפיס כוכבית ויחזור לבדוק אם המשתנה שהוסף לו 1 נכון לתנאי *
//        * ( הכוכבית תמיד תודפס בשורה חדשה (println) ) *
//        * אם כן הוא יעשה את הפעולה עוד פעם עד שהתנאי יהיה שגוי ורק אז יצא מהלולאה *
//        * (בגלל שה-i שווה 1 ובודק אם הוא קטן שווה 10 אז הוא ידפיס את הכוכבית 10 פעמים) *


//        part 2:-
//        * המטודה f2 היא מטודה שמחזירה ערך מסוג אנט וגם מקבלת פרמטר מסוג אנט *
//        * בתוך המטודה יש משתנה מסוג אנט ששווה ל-0 והשם שלו הוא c *
//        * אותה פעולה של הלולאה בפרק שלפני אבל המשתנה מתחיל מ-0 ובודק אם הוא קטן שווה להמספר שהוכנס כפרמטר *
//        * כל עוד הוא נכון הוא יכנס לתנאי *
//        * התנאי אומר אם הערך של i מודול 3 נותן 0 (שזה אומר שהמספר יחולק לשלוש בלי שאר) יוסף להמשתנה c אחד *
//        * אם התנאי של if לא נכון אז הוא לא יכנס אליו ויחזור להמספר הבא בלולאה, עד שהתנאי של הלולאה יהיה שגוי אז הוא יצא ממנה *
//        * המטודה תחזיר את הערך של c (מספר מסוג אנט) *
//        * (בגלל שה-i שווה 0 אז אם היה למשל הערך 5 הוא יחזור על הלולאה ששה פעמים) *

//        part 3:-
//        * המטודה f3 היא מטודה שמחזירה ערך מסוג אנט ומקבלת פרמטר מסוג אנט והפרמטר הזה מקבל המספר שבודק בתוך התנאי ה-while *
//        * בתוך המטודה יש משתנה מסוג אנט ששווה ל-0 והשם שלו הוא c *
//        * כל עוד התנאי נכון הוא יכנס ללולאה, בהתחלה הוא יחלק 10 מה-x ואז יוסיף אחד להמשתנה c *
//        * ואז יחזור לבדוק אם התנאי נכון אחרי שחלק ל-10 *
//        * כשהתנאי יהיה שגוי אז הוא יצא מהלולאה ויחזיר את הערך של c (מספר מסוג אנט) *
//        * (כל עוד התנאי גדול מ-0 הלולאה תעבוד) *

//        ========================= QUESTION-4 : BOOK =========================
        System.out.println("--- QUESTION-4 : BOOK ---");

        Book book1 = new Book("Oliver Twist", "Charles Dikens", 200);
        System.out.println(book1);
        System.out.println("Book name: " + book1.getName());
        System.out.println("Book author: " + book1.getAuthor());
        System.out.println("Book pages: " + book1.getNumberOfPages());
    }

}